/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package org.complitex.osznconnection.file.entity;

/**
 *
 * @author Artem
 */
public enum ActualPaymentDBF {

    SUR_NAM, //Фамилия
    F_NAM, //Имя
    M_NAM, //Отчество
    INDX, //Индекс почтового отделения
    N_NAME, //Название населенного пункта
    N_CODE,
    VUL_CAT, //Тип улицы
    VUL_NAME, //Название улицы
    VUL_CODE, //Код улицы
    BLD_NUM, //Номер дома
    CORP_NUM, //Номер корпуса
    FLAT, //Номер квартиры
    OWN_NUM, //Номер дела
    APP_NUM,
    DAT_BEG,
    DAT_END,
    CM_AREA,
    NM_AREA,
    BLC_AREA,
    FROG,
    DEBT,
    NUMB,
    P1, //фактическое начисление по квартплате
    N1, //фактический тариф по квартплате
    P2, //фактическое начисление по отоплению
    N2, //фактический тариф по отоплению
    P3, //фактическое начисление по горячему водоснабжению
    N3, //фактический тариф по горячему водоснабжению
    P4, //фактическое начисление по холодному водоснабжению
    N4, //фактический тариф по холодному водоснабжению
    P5, //фактическое начисление по газу
    N5, //фактический тариф по газу
    P6, //фактическое начисление по электроэнергии
    N6, //фактический тариф по электроэнергии
    P7, //фактическое начисление за вывоз мусора
    N7, //фактический тариф за вывоз мусора
    P8, //фактическое начисление за водоотведение
    N8; //фактический тариф за водоотведение
}
